# На столе лежат n монеток. Некоторые из них лежат вверх решкой,
# а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть,
# чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть
# n = int(input())

# coin_up = 0
# coin_down = 0

# for i in range(n):
#     x = input()
#     if int(x) == 0:
#         coin_up += 1
#     else:
#         coin_down += 1

# if coin_up < coin_down:
#     print(coin_up)
# else:
#     print(coin_down)
# -------------------------------------------------------------------------------